<template>
  <div>
    <van-dialog
      v-model:show="show"
      title="钱包密码"
      show-cancel-button
      :before-close="beforeClose"
    >
      <van-form style="padding: 20px">
        <van-field
          autocomplete="off"
          style="padding: 0 20px"
          v-model="password"
          type="password"
          label="密码"
          label-width="60"
          placeholder="请输入密码"
        />
        <van-field
          autocomplete="off"
          style="padding: 0 20px"
          v-model="toAddress"
          label="转账地址"
          label-width="60"
          placeholder="请输入转账地址"
        />
        <van-field
          autocomplete="off"
          style="padding: 0 20px"
          v-model="transferAmount"
          label="转账金额"
          label-width="60"
          placeholder="请输入转账金额"
        />
      </van-form>
    </van-dialog>
    <van-cell
      style="display: flex; align-items: center"
      title-style="flex:0.6"
      :title="
        item.address.slice(0, 6) +
        '...' +
        item.address.substring(item.address.length - 6)
      "
      icon="shop-o"
      v-for="(item, index) in accountList"
      :key="index"
    >
      <template #value>
        <van-button
        style="margin-right: 30px;"
          type="primary"
          plain
          size="mini"
          class="copy"
          :data-clipboard-text="item.address"
          @click="copy"
          >复制地址</van-button
        >
        <div style="display: flex; align-items: center;width: 50px;">
          <svg
            t="1677743155464"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="2846"
            width="16"
            height="16"
          >
            <path
              d="M439.985152 154.990592c94.646272 0 181.102592 7.907328 244.36736 20.72576 10.376192 2.101248 20.241408 4.426752 29.509632 6.9888 27.068416 7.3984 96.073728 30.98624 96.073728 66.83648l1.473536 109.584384c6.895616 1.199104 13.55264 2.465792 20.00896 3.757056 10.351616 2.097152 20.224 4.425728 29.510656 6.984704 27.047936 7.401472 96.077824 30.98624 96.077824 66.837504l1.862656 138.63424c0 37.072896-48.116736 65.292288-125.855744 81.017856-8.531968 1.702912-17.475584 3.36384-26.769408 4.887552l1.267712 93.512704c0 37.117952-48.11776 65.339392-125.904896 81.015808-63.40608 12.817408-150.096896 20.750336-244.988928 20.750336-94.897152 0-181.586944-7.932928-245.010432-20.750336-77.76768-15.67744-125.884416-43.897856-125.884416-81.015808L65.723392 636.852224l0-13.4656 0-7.235584c0-29.144064 46.825472-50.033664 69.812224-58.518528 16.207872-5.945344 34.92864-11.065344 55.793664-15.306752 8.208384-1.659904 16.805888-3.226624 25.750528-4.704256l0-64.4864c-7.28576-1.243136-14.3616-2.558976-21.18656-3.9424-77.743104-15.67744-125.858816-43.96544-125.858816-81.03936L70.034432 270.22336l0-13.463552 0-7.218176c0-29.140992 46.824448-50.052096 69.787648-58.51648 16.231424-5.970944 34.952192-11.086848 55.81824-15.309824C258.907136 162.89792 345.344 154.990592 439.985152 154.990592L439.985152 154.990592zM334.646272 654.605312c-52.037632-11.436032-89.68704-28.730368-106.97728-50.721792-8.071168 1.33632-15.816704 2.719744-23.172096 4.242432-24.278016 4.932608-43.459584 8.89856-55.770112 11.529216-0.277504 2.441216-0.785408 4.795392-1.547264 7.053312 12.244992 2.674688 32.024576 6.77888 57.317376 11.895808C240.231424 645.796864 284.68224 651.377664 334.646272 654.605312L334.646272 654.605312zM154.4192 708.692992l0 50.999296c11.019264 2.306048 25.982976 5.395456 44.082176 9.0368l0-49.523712c-2.305024-0.411648-4.635648-0.874496-6.89152-1.334272C178.305024 715.196416 165.879808 712.103936 154.4192 708.692992L154.4192 708.692992zM693.229568 715.332608l0 49.659904c25.358336-5.210112 41.797632-8.71424 45.902848-9.864192-0.55296-2.399232-0.874496-4.93568-0.874496-7.517184l0-45.18912C724.905984 707.216384 709.80608 711.550976 693.229568 715.332608L693.229568 715.332608zM649.677824 773.52448l0-49.936384c-17.224704 2.716672-35.692544 5.115904-55.2448 7.1936l0 50.398208C614.263808 778.964992 632.756224 776.428544 649.677824 773.52448L649.677824 773.52448zM550.904832 785.096704l0-50.489344c-24.508416 1.753088-50.238464 2.951168-76.7744 3.597312l0 50.537472C500.89984 788.14208 526.604288 786.895872 550.904832 785.096704L550.904832 785.096704zM356.041728 736.636928l0 50.536448c23.861248 1.199104 48.805888 1.891328 74.515456 1.982464L430.557184 738.573312C405.011456 738.480128 380.064768 737.833984 356.041728 736.636928L356.041728 736.636928zM312.489984 784.360448l0-50.491392c-24.925184-1.937408-48.557056-4.518912-70.434816-7.51616l0 50.122752C263.586816 779.657216 287.219712 782.2848 312.489984 784.360448L312.489984 784.360448zM794.281984 424.303616c-20.570112 19.482624-58.309632 34.791424-108.342272 44.88704-15.355904 3.09248-32.068608 5.902336-49.911808 8.392704 71.2192-2.120704 134.459392-8.76032 182.23104-18.444288 26.512384-5.348352 46.985216-9.591808 59.044864-12.240896-0.672768-2.029568-1.104896-4.151296-1.362944-6.295552-12.243968-2.629632-32.115712-6.755328-57.68192-11.921408C810.648576 427.138048 802.64704 425.686016 794.281984 424.303616L794.281984 424.303616zM305.780736 529.275904l0 50.951168c11.019264 2.305024 25.982976 5.440512 44.082176 9.084928l0-49.521664c-2.3296-0.461824-4.611072-0.878592-6.895616-1.338368C329.66656 535.732224 317.2608 532.685824 305.780736 529.275904L305.780736 529.275904zM844.61056 535.866368l0 49.666048c25.339904-5.21216 41.757696-8.718336 45.856768-9.824256-0.53248-2.441216-0.830464-4.979712-0.830464-7.56224l0-45.18912C876.2624 527.751168 861.187072 532.08576 844.61056 535.866368L844.61056 535.866368zM801.058816 594.060288l0-49.892352c-17.243136 2.722816-35.710976 5.12-55.221248 7.1936l0 50.353152C765.597696 599.501824 784.113664 596.968448 801.058816 594.060288L801.058816 594.060288zM702.267392 605.681664l0-50.538496c-24.508416 1.801216-50.215936 2.999296-76.752896 3.596288l0 50.53952C652.260352 608.722944 677.98528 607.432704 702.267392 605.681664L702.267392 605.681664zM507.399168 557.172736l0 50.536448c23.86432 1.201152 48.811008 1.936384 74.56256 1.984512l0-50.537472C556.372992 559.06304 531.423232 558.369792 507.399168 557.172736L507.399168 557.172736zM463.849472 604.94336l0-50.538496c-24.92416-1.937408-48.53248-4.518912-70.413312-7.513088l0 50.11968C414.947328 600.23808 438.557696 602.820608 463.849472 604.94336L463.849472 604.94336zM158.731264 342.132736l0 50.930688c11.022336 2.325504 25.982976 5.417984 44.081152 9.08288l0-49.547264c-2.35008-0.437248-4.634624-0.899072-6.916096-1.359872C182.617088 348.565504 170.189824 345.521152 158.731264 342.132736L158.731264 342.132736zM697.536512 348.704768l0 49.636352c25.365504-5.164032 41.781248-8.689664 45.886464-9.795584-0.553984-2.445312-0.833536-4.978688-0.833536-7.540736l0-45.233152C729.219072 340.589568 714.136576 344.923136 697.536512 348.704768L697.536512 348.704768zM653.984768 406.874112l0-49.893376c-17.243136 2.719744-35.709952 5.14048-55.21408 7.1936l0 50.376704C618.55232 412.383232 637.064192 409.801728 653.984768 406.874112L653.984768 406.874112zM555.193344 418.49344l0-50.514944c-24.507392 1.773568-50.213888 2.996224-76.752896 3.597312l0 50.538496C505.209856 421.536768 530.9184 420.314112 555.193344 418.49344L555.193344 418.49344zM360.351744 370.029568 360.351744 420.590592c23.83872 1.175552 48.809984 1.844224 74.539008 1.936384l0-50.56C409.322496 371.872768 384.374784 371.227648 360.351744 370.029568L360.351744 370.029568zM316.8 417.731584l0-50.469888c-24.943616-1.957888-48.533504-4.49536-70.433792-7.538688l0 50.1248C267.877376 413.028352 291.506176 415.678464 316.8 417.731584L316.8 417.731584zM153.013248 253.046784c-0.27648 2.397184-0.76288 4.770816-1.519616 7.076864 12.240896 2.650112 32.001024 6.7328 57.290752 11.851776 58.446848 11.848704 140.155904 19.158016 231.200768 19.158016 91.06944 0 172.756992-7.309312 231.200768-19.158016 26.535936-5.348352 46.985216-9.590784 59.045888-12.22144-0.642048-2.0736-1.106944-4.1728-1.36192-6.315008-12.215296-2.629632-32.111616-6.756352-57.683968-11.943936-58.443776-11.804672-140.131328-19.134464-231.200768-19.134464-91.044864 0-172.75392 7.329792-231.200768 19.134464C184.508416 246.429696 165.347328 250.396672 153.013248 253.046784z"
              p-id="2847"
            ></path>
          </svg>
          {{ item.balance.slice(0, 5) }}
        </div>
        <van-button
          type="primary"
          plain
          size="mini"
          @click="transaction(item.keyStore, item.password, item.address)"
          >转账</van-button
        >
      </template>
    </van-cell>
  </div>
</template>

<script setup lang="ts">
import Clipboard from "clipboard";
import { reactive, toRefs } from "vue";
import store2 from "store2";
import Web3 from "web3";
import { showToast } from "vant";
import * as wt from "ethereumjs-wallet";
import Tx from "ethereumjs-tx";
const state = reactive<{
  password: string;
  show: boolean;
  toAddress: string;
  transferAmount: string;
  accountList: Array<{
    address: string;
    balance: string;
    keyStore: {};
    password: string;
  }>;
  accountInfo: {
    password: string;
    keyStore: any;
    address: string;
  };
}>({
  password: "",
  show: false,
  toAddress: "",
  transferAmount: "",
  accountList: store2.get("walletInfo") || [],
  accountInfo: {
    password: "",
    keyStore: {},
    address: "",
  },
});
let { accountList, show, password, accountInfo, toAddress, transferAmount } =
  toRefs(state);
// 初始化wbe3
var web3 = new Web3(
  Web3.givenProvider ||
    "wss://goerli.infura.io/ws/v3/a132e98ebba440129ba1bdd405b9eae1"
);
// 获取账户对应余额
accountList.value.forEach(async (item) => {
  let wei = await web3.eth.getBalance(item.address);
  item.balance = web3.utils.fromWei(wei, "ether");
});
// 点击复制
const copy = () => {
  let clipboard = new Clipboard(".copy");
  clipboard.on("success", () => {
    showToast("复制成功");
    // 释放内存
    clipboard.destroy();
  });
  clipboard.on("error", (e) => {
    // 不支持复制
    showToast("该浏览器不支持自动复制");
    // 释放内存
    clipboard.destroy();
  });
};
// 点击转账
const transaction = (keyStore: {}, password: string, address: string) => {
  accountInfo.value.keyStore = keyStore;
  accountInfo.value.password = password;
  accountInfo.value.address = address;
  show.value = true;
};
// 密码dialog点击确认或取消
const beforeClose = (action: string) => {
  if (action === "confirm") {
    if (password.value === accountInfo.value.password) {
      show.value = false;
      send();
      password.value = "";
    } else {
      showToast("您输入的密码不正确");
    }
  } else {
    show.value = false;
    password.value = "";
  }
};
// 转账
const send = async () => {
  const pk1 = await wt.default.fromV3(
    accountInfo.value.keyStore,
    accountInfo.value.password
  );
  const pk2 = pk1.getPrivateKey().toString("hex");
  // 获取账户交易次数
  const nonce = await web3.eth.getTransactionCount(accountInfo.value.address);
  //   获取预计转账的gas费
  const gasPrice = await web3.eth.getGasPrice();
  //   转账金额以wei为单位
  const value = web3.utils.toWei(transferAmount.value);
  const rawTx = {
    from: accountInfo.value.address,
    to: toAddress.value,
    nonce,
    gasPrice,
    value,
    data: "0x00",
    gas: 0,
  };
  //   生成serializedTx
  // 转化私钥
  const privateKey = Buffer.from(pk2, "hex");
  //   gas估算
  const gas = await web3.eth.estimateGas(rawTx);
  rawTx.gas = gas;
  //   ethereumjs-tx实现私钥加密
  const tx = new Tx(rawTx);
  tx.sign(privateKey);
  //生成 serializeTx
  const serializeTx = `0x${tx.serialize().toString("hex")}`;
  //   开始转帐
  const trans = web3.eth.sendSignedTransaction(serializeTx);
  //   监听转账
  // 开始转帐就开始监听并返回交易id
  trans.on("transactionHash", (txId) => {
    console.log("交易ID:", txId);
    console.log(`https://goerli.etherscan.io/tx/${txId}`);
  });
  // 有节点确认才会触发
  trans.on("receipt", (res) => {
    console.log(res);
  });
  // 有除第一个节点以外的其他节点确认就会一直打印
  trans.on("confirmation", (res) => {
    console.log("有几个节点确认", res);
  });
};
</script>

<style scoped lang="less">
/deep/.van-cell__value {
  display: flex;
  justify-content: space-between;
}
</style>
